importing pandas

In [3]:
import pandas as pd

SERIES

In [2]:
print('Series with numbers')
ser1=pd.Series([10,20,30,40,50])
print(ser1)

Series with numbers
0    10
1    20
2    30
3    40
4    50
dtype: int64

In [3]:
print('Series with strings')
ser2=pd.Series(['python','AWS','java'])
print(ser2)

Series with strings
0    python
1       AWS
2      java
dtype: object

In [4]:
print("Slicing Series")
print(ser1[1:4])
print(ser1[::-1])
print(ser2.iloc[-1])
print(ser2.head())
print(ser2.tail())
print(ser2.head(2))
print(ser2.tail(2))

Slicing Series
1    20
2    30
3    40
dtype: int64
4    50
3    40
2    30
1    20
0    10
dtype: int64
java
0    python
1       AWS
2      java
dtype: object
0    python
1       AWS
2      java
dtype: object
0    python
1       AWS
dtype: object
1     AWS
2    java
dtype: object

DATAFRAME

In [5]:
print('DataFrames with numbers')
df1=pd.DataFrame({1,2,3,4,5})
print(df1)

DataFrames with numbers
   0
0  1
1  2
2  3
3  4
4  5

In [6]:
print('DataFrames with strings')
df2=pd.DataFrame({'id':['101','102','103','104','105'],'course':['java','AWS','python','cloud','html']})
print(df2)
print(df2['id'])
print(df2['id'][1:3])
print(df2['course'])
print(df2['course'][1:4])

DataFrames with strings
    id  course
0  101    java
1  102     AWS
2  103  python
3  104   cloud
4  105    html
0    101
1    102
2    103
3    104
4    105
Name: id, dtype: object
1    102
2    103
Name: id, dtype: object
0      java
1       AWS
2    python
3     cloud
4      html
Name: course, dtype: object
1       AWS
2    python
3     cloud
Name: course, dtype: object

In [7]:
print("Slicing Series")
print(df1[1:3])
print(df1[::-1])
print(df1.iloc[-3])
print(df2.head())
print(df2.tail())
print(df2.head(2))
print(df2.tail(2))

Slicing Series
   0
1  2
2  3
   0
4  5
3  4
2  3
1  2
0  1
0    3
Name: 2, dtype: int64
    id  course
0  101    java
1  102     AWS
2  103  python
3  104   cloud
4  105    html
    id  course
0  101    java
1  102     AWS
2  103  python
3  104   cloud
4  105    html
    id course
0  101   java
1  102    AWS
    id course
3  104  cloud
4  105   html

In [8]:
df3=pd.DataFrame({'sid':['101','102','103','104','105','106','107','108','109','110'],
      'sname':['ramu','ravi','kiran','raju','karthik','kumar',
               'balu','srinu','kishore','john']
      })
print(df3)
print(df3.iloc[1])
print(df3.iloc[0,0])
print(df3.iloc[5,1])

   sid    sname
0  101     ramu
1  102     ravi
2  103    kiran
3  104     raju
4  105  karthik
5  106    kumar
6  107     balu
7  108    srinu
8  109  kishore
9  110     john
sid       102
sname    ravi
Name: 1, dtype: object
101
kumar

In [9]:
df4=pd.DataFrame({
    'empno':[1001,1002,1003,1004,1005,1006,1007,1008],
    'ename':['ravi','ramu','raju','hari','giri','suri','raghu','kumar'],
    'job':['dev','tester','dev','devops','manager','dev','tester','dev']
})
print(df4)
print(df4.iloc[1,2])
print(df4.iloc[3,2])
print(df4.iloc[7,1])
print(df4.iloc[0:5])
print(df4.iloc[::-1])
print(df4.iloc[:,0])#complete record,1st column
print(df4.iloc[:,1])
print(df4.iloc[:,2])

   empno  ename      job
0   1001   ravi      dev
1   1002   ramu   tester
2   1003   raju      dev
3   1004   hari   devops
4   1005   giri  manager
5   1006   suri      dev
6   1007  raghu   tester
7   1008  kumar      dev
tester
devops
kumar
   empno ename      job
0   1001  ravi      dev
1   1002  ramu   tester
2   1003  raju      dev
3   1004  hari   devops
4   1005  giri  manager
   empno  ename      job
7   1008  kumar      dev
6   1007  raghu   tester
5   1006   suri      dev
4   1005   giri  manager
3   1004   hari   devops
2   1003   raju      dev
1   1002   ramu   tester
0   1001   ravi      dev
0    1001
1    1002
2    1003
3    1004
4    1005
5    1006
6    1007
7    1008
Name: empno, dtype: int64
0     ravi
1     ramu
2     raju
3     hari
4     giri
5     suri
6    raghu
7    kumar
Name: ename, dtype: object
0        dev
1     tester
2        dev
3     devops
4    manager
5        dev
6     tester
7        dev
Name: job, dtype: object

In [16]:
df5=pd.DataFrame({
    'empno':[1001,1002,1003,1004,1005,1006,1007,1008],
    'ename':['ravi','ramu','raju','hari','giri','suri','raghu','kumar'],
    'job':['dev','tester','dev','devops','manager','dev','tester','dev'],
    'sal':[2443,7922,3579,5793,7942,8327,5932,4792]
})
print(df5)
print(df5.iloc[[0,1,2],[1,3]])

   empno  ename      job   sal
0   1001   ravi      dev  2443
1   1002   ramu   tester  7922
2   1003   raju      dev  3579
3   1004   hari   devops  5793
4   1005   giri  manager  7942
5   1006   suri      dev  8327
6   1007  raghu   tester  5932
7   1008  kumar      dev  4792
  ename   sal
0  ravi  2443
1  ramu  7922
2  raju  3579

np.int64(2443)

In [18]:
df5.loc[1,'sal']

np.int64(7922)

In [20]:
df5.loc[3,['ename','sal']]

ename    hari
sal      5793
Name: 3, dtype: object

In [27]:
df5=pd.DataFrame({
    'empno':[1001,1002,1003,1004,1005,1006,1007,1008],
    'ename':['ravi','ramu','raju','hari','giri','suri','raghu','kumar'],
    'job':['dev','tester','dev','devops','manager','dev','tester','dev'], 
    'sal':[2443,7922,3579,5793,7942,8327,5932,4792],
    'deptno':[10,20,30,40,26,47,89,46]
})
df5

   empno  ename      job   sal  deptno
0   1001   ravi      dev  2443      10
1   1002   ramu   tester  7922      20
2   1003   raju      dev  3579      30
3   1004   hari   devops  5793      40
4   1005   giri  manager  7942      26
5   1006   suri      dev  8327      47
6   1007  raghu   tester  5932      89
7   1008  kumar      dev  4792      46

In [28]:
df5.iloc[::-1]

   empno  ename      job   sal  deptno
7   1008  kumar      dev  4792      46
6   1007  raghu   tester  5932      89
5   1006   suri      dev  8327      47
4   1005   giri  manager  7942      26
3   1004   hari   devops  5793      40
2   1003   raju      dev  3579      30
1   1002   ramu   tester  7922      20
0   1001   ravi      dev  2443      10

In [29]:
df5.iloc[2:9]

   empno  ename      job   sal  deptno
2   1003   raju      dev  3579      30
3   1004   hari   devops  5793      40
4   1005   giri  manager  7942      26
5   1006   suri      dev  8327      47
6   1007  raghu   tester  5932      89
7   1008  kumar      dev  4792      46

In [30]:
df5.loc[2,]

empno     1003
ename     raju
job        dev
sal       3579
deptno      30
Name: 2, dtype: object

In [39]:
df5.loc[[2],['empno','ename','job','sal','deptno']]

   empno ename  job   sal  deptno
2   1003  raju  dev  3579      30

In [40]:
df5

   empno  ename      job   sal  deptno
0   1001   ravi      dev  2443      10
1   1002   ramu   tester  7922      20
2   1003   raju      dev  3579      30
3   1004   hari   devops  5793      40
4   1005   giri  manager  7942      26
5   1006   suri      dev  8327      47
6   1007  raghu   tester  5932      89
7   1008  kumar      dev  4792      46

In [41]:
df5.index[-1]

7

In [42]:
df5.loc[[df5.index[-1]],'sal']

7    4792
Name: sal, dtype: int64

In [44]:
#get all employees who are developers
df5[df5['job']=='dev']

   empno  ename  job   sal  deptno
0   1001   ravi  dev  2443      10
2   1003   raju  dev  3579      30
5   1006   suri  dev  8327      47
7   1008  kumar  dev  4792      46

In [48]:
#get all employees whose salary more than 5000
df5[df5['sal']>=5000]

   empno  ename      job   sal  deptno
1   1002   ramu   tester  7922      20
3   1004   hari   devops  5793      40
4   1005   giri  manager  7942      26
5   1006   suri      dev  8327      47
6   1007  raghu   tester  5932      89

In [5]:
import pandas as pd 
df5=pd.DataFrame({
    'empno':[1001,1002,1003,1004,1005,1006,1007,1008],
    'ename':['ravi','ramu','raju','hari','giri','suri','raghu','kumar'],
    'job':['dev','tester','dev','devops','manager','dev','tester','dev'], 
    'sal':[2443,7922,3579,5793,7942,8327,5932,4792],
    'deptno':[10,20,30,40,26,47,89,46]
})
df5

   empno  ename      job   sal  deptno
0   1001   ravi      dev  2443      10
1   1002   ramu   tester  7922      20
2   1003   raju      dev  3579      30
3   1004   hari   devops  5793      40
4   1005   giri  manager  7942      26
5   1006   suri      dev  8327      47
6   1007  raghu   tester  5932      89
7   1008  kumar      dev  4792      46

In [7]:
#get all employee details based on name given
name_given=input("Enter employee name")
df5[df5['ename']==name_given]

Enter employee name hari

   empno ename     job   sal  deptno
3   1004  hari  devops  5793      40

In [30]:
df5[df5['job']=='dev']

   empno  ename  job   sal  deptno
0   1001   ravi  dev  2443      10
2   1003   raju  dev  3579      30
5   1006   suri  dev  8327      47
7   1008  kumar  dev  4792      46

In [35]:
#get all developers information whose sal is more than 5000
df5[(df5['job']=='dev') | (df5['job']=='tester')]

   empno  ename     job   sal  deptno
0   1001   ravi     dev  2443      10
1   1002   ramu  tester  7922      20
2   1003   raju     dev  3579      30
5   1006   suri     dev  8327      47
6   1007  raghu  tester  5932      89
7   1008  kumar     dev  4792      46

In [36]:
#aggregate functions
df5['sal']

0    2443
1    7922
2    3579
3    5793
4    7942
5    8327
6    5932
7    4792
Name: sal, dtype: int64

In [38]:
df5['sal'].max()

8327

In [39]:
df5['sal'].min()

2443

In [2]:
import pandas as pd 
df5=pd.DataFrame({
    'empno':[1001,1002,1003,1004,1005,1006,1007,1008],
    'ename':['ravi','ramu','raju','hari','giri','suri','raghu','kumar'],
    'job':['dev','tester','dev','devops','manager','dev','tester','dev'], 
    'sal':[2443,7922,3579,5793,7942,8327,5932,4792],
    'deptno':[10,20,30,40,26,47,89,46]
})

In [3]:
df5['sal'].std()

2161.315455920306

In [7]:
df5['sal'].mean()

np.float64(5841.25)

In [8]:
df5.describe()

            empno          sal    deptno
count     8.00000     8.000000   8.00000
mean   1004.50000  5841.250000  38.50000
std       2.44949  2161.315456  24.09505
min    1001.00000  2443.000000  10.00000
25%    1002.75000  4488.750000  24.50000
50%    1004.50000  5862.500000  35.00000
75%    1006.25000  7927.000000  46.25000
max    1008.00000  8327.000000  89.00000

In [9]:
df5['sal'].describe()

count       8.000000
mean     5841.250000
std      2161.315456
min      2443.000000
25%      4488.750000
50%      5862.500000
75%      7927.000000
max      8327.000000
Name: sal, dtype: float64

In [3]:
df5['sal'].cumsum()

0     2443
1    10365
2    13944
3    19737
4    27679
5    36006
6    41938
7    46730
Name: sal, dtype: int64

In [12]:
emptydata={
    'empno':[1001,1002,1003,1004,1005,1006,1007,1008,1009],
    'ename':['ravi','ramu','raju','hari','giri','suri','raghu','kumar','varma'],
    'job':['dev','tester','dev','devops','manager','dev','tester','dev','Dev'], 
    'sal':[2443,7922,3579,5793,7942,8327,5932,4792,3463],
    'deptno':[10,20,30,40,26,47,89,46,37]
}
emptydata
type(emptydata)

dict

In [13]:
import pandas as pd
df6=pd.DataFrame(emptydata)
df6

   empno  ename      job   sal  deptno
0   1001   ravi      dev  2443      10
1   1002   ramu   tester  7922      20
2   1003   raju      dev  3579      30
3   1004   hari   devops  5793      40
4   1005   giri  manager  7942      26
5   1006   suri      dev  8327      47
6   1007  raghu   tester  5932      89
7   1008  kumar      dev  4792      46
8   1009  varma      Dev  3463      37

In [20]:
df6[df6['job']=='dev']

   empno  ename  job   sal  deptno
0   1001   ravi  dev  2443      10
2   1003   raju  dev  3579      30
5   1006   suri  dev  8327      47
7   1008  kumar  dev  4792      46

In [21]:
df6[df6['job']=='Dev']

   empno  ename  job   sal  deptno
8   1009  varma  Dev  3463      37

In [15]:
df6[df6['job'].str.lower()=='dev']

   empno  ename  job   sal  deptno
0   1001   ravi  dev  2443      10
2   1003   raju  dev  3579      30
5   1006   suri  dev  8327      47
7   1008  kumar  dev  4792      46
8   1009  varma  Dev  3463      37

In [1]:
import pandas as pd

In [3]:
#reading data from csv file
eData=pd.read_csv('eData.csv')
eData

   empno   ename    job   sal  deptno
0   1001    raju    dev  1200    10.0
1    102    ravi   test  1000    20.0
2    103   kumar  saled  1500    30.0
3   1004  venkat  saled  1600    30.0
4   1005    suri   test  1200     NaN

In [6]:
#reading data from csv file with delimiter
eData2=pd.read_csv('eData2.csv',delimiter='#')
eData2

   empno   ename   job   sal  deptno
0   1001    raju   dev  1200    10.0
1    102    ravi  test  1000    20.0
2    103   kumar  sale  1500    30.0
3   1004  venkat  sale  1600    30.0
4   1005    suri  test  1200     NaN
5   1006    hari   dev  1100    30.0

In [10]:
eData.shape

(5, 5)

In [11]:
eData2.shape

(6, 5)

In [12]:
eData.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   empno   5 non-null      int64
 1   ename   5 non-null      object
 2   job     5 non-null      object
 3   sal     5 non-null      int64
 4   deptno  4 non-null      float64
dtypes: float64(1), int64(2), object(2)
memory usage: 332.0+ bytes

In [13]:
eData2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   empno   6 non-null      int64
 1   ename   6 non-null      object
 2   job     6 non-null      object
 3   sal     6 non-null      int64
 4   deptno  5 non-null      float64
dtypes: float64(1), int64(2), object(2)
memory usage: 372.0+ bytes

In [14]:
eData.index

RangeIndex(start=0, stop=5, step=1)

In [17]:
eData2.index

RangeIndex(start=0, stop=6, step=1)

In [15]:
eData.dtypes

empno       int64
ename      object
job        object
sal         int64
deptno    float64
dtype: object

In [18]:
eData2.dtypes

empno       int64
ename      object
job        object
sal         int64
deptno    float64
dtype: object

In [16]:
eData.columns

Index(['empno', 'ename', 'job', 'sal', 'deptno'], dtype='object')

In [19]:
eData2.columns

Index(['empno', 'ename', 'job', 'sal', 'deptno'], dtype='object')

In [20]:
eData2

   empno   ename   job   sal  deptno
0   1001    raju   dev  1200    10.0
1    102    ravi  test  1000    20.0
2    103   kumar  sale  1500    30.0
3   1004  venkat  sale  1600    30.0
4   1005    suri  test  1200     NaN
5   1006    hari   dev  1100    30.0

iloc->Gives position

In [21]:
eData2.iloc[4]

empno     1005
ename     suri
job       test
sal       1200
deptno     NaN
Name: 4, dtype: object

In [27]:
eData2.iloc[1,3]

np.int64(1000)

In [24]:
eData2.iloc[4,2]

'test'

loc->Gives based on label

In [23]:
eData2.loc[4,'ename']

'suri'

In [25]:
eData2.at[0,'sal']

np.int64(1200)

In [26]:
eData2.at[5,'ename']

'hari'

pip install sqlalchemy

In [9]:
from sqlalchemy import create_engine

In [10]:
import pandas as pd

In [11]:
engine = create_engine("mysql+mysqlconnector://root:root@localhost/EmployeeDB")

In [12]:
empdata = pd.read_sql("SELECT * FROM employee", engine)

In [13]:
empdata

,emp_id,emp_name,job_title,salary,hire_date,dept_id,manager_id
0,101,John Mathews,General Manager,90000.0,2017-03-10,50,NaN
1,102,Priya Sharma,HR Manager,75000.0,2018-06-21,10,101.0
2,103,Ravi Kumar,Finance Manager,72000.0,2019-02-11,20,101.0
3,104,Anita Singh,IT Manager,85000.0,2018-11-05,30,101.0
4,105,Karan Patel,Sales Manager,78000.0,2019-07-17,40,101.0
5,106,Deepa Nair,HR Executive,42000.0,2020-03-14,10,102.0
6,107,Vikas Reddy,Recruiter,38000.0,2021-01-09,10,102.0
7,108,Amit Verma,Accountant,45000.0,2020-09-22,20,103.0
8,109,Sonal Gupta,Financial Analyst,52000.0,2021-06-13,20,103.0
9,110,Neha Mehta,IT Developer,61000.0,2020-08-18,30,104.0
10,111,Arjun Das,Software Engineer,64000.0,2022-02-20,30,104.0
11,112,Pooja Iyer,Data Analyst,58000.0,2021-10-27,30,104.0
12,113,Ramesh Rao,Sales Executive,47000.0,2022-05-15,40,105.0
13,114,Sneha Joshi,Sales Representative,43000.0,2023-01-05,40,105.0
14,115,Dev Patel,Sales Intern,25000.0,2024-04-12,40,105.0
15,116,Tina George,Operations Lead,67000.0,2020-12-01,50,101.0
16,117,Rahul Roy,Operations Executive,45000.0,2021-08-09,50,116.0
17,118,Meena Paul,Logistics Officer,42000.0,2022-07-19,50,116.0
18,119,Abhishek Yadav,Clerk,32000.0,2023-03-28,20,103.0
19,120,Lakshmi Menon,Assistant HR,37000.0,2024-02-12,10,102.0

In [23]:
empdata_sal=pd.read_sql('SELECT * FROM Employee where salary>60000;', engine)

In [24]:
empdata_sal

,emp_id,emp_name,job_title,salary,hire_date,dept_id,manager_id
0,101,John Mathews,General Manager,90000.0,2017-03-10,50,NaN
1,102,Priya Sharma,HR Manager,75000.0,2018-06-21,10,101.0
2,103,Ravi Kumar,Finance Manager,72000.0,2019-02-11,20,101.0
3,104,Anita Singh,IT Manager,85000.0,2018-11-05,30,101.0
4,105,Karan Patel,Sales Manager,78000.0,2019-07-17,40,101.0
5,110,Neha Mehta,IT Developer,61000.0,2020-08-18,30,104.0
6,111,Arjun Das,Software Engineer,64000.0,2022-02-20,30,104.0
7,116,Tina George,Operations Lead,67000.0,2020-12-01,50,101.0

In [25]:
empdata

,emp_id,emp_name,job_title,salary,hire_date,dept_id,manager_id
0,101,John Mathews,General Manager,90000.0,2017-03-10,50,NaN
1,102,Priya Sharma,HR Manager,75000.0,2018-06-21,10,101.0
2,103,Ravi Kumar,Finance Manager,72000.0,2019-02-11,20,101.0
3,104,Anita Singh,IT Manager,85000.0,2018-11-05,30,101.0
4,105,Karan Patel,Sales Manager,78000.0,2019-07-17,40,101.0
5,106,Deepa Nair,HR Executive,42000.0,2020-03-14,10,102.0
6,107,Vikas Reddy,Recruiter,38000.0,2021-01-09,10,102.0
7,108,Amit Verma,Accountant,45000.0,2020-09-22,20,103.0
8,109,Sonal Gupta,Financial Analyst,52000.0,2021-06-13,20,103.0
9,110,Neha Mehta,IT Developer,61000.0,2020-08-18,30,104.0
10,111,Arjun Das,Software Engineer,64000.0,2022-02-20,30,104.0
11,112,Pooja Iyer,Data Analyst,58000.0,2021-10-27,30,104.0
12,113,Ramesh Rao,Sales Executive,47000.0,2022-05-15,40,105.0
13,114,Sneha Joshi,Sales Representative,43000.0,2023-01-05,40,105.0
14,115,Dev Patel,Sales Intern,25000.0,2024-04-12,40,105.0
15,116,Tina George,Operations Lead,67000.0,2020-12-01,50,101.0
16,117,Rahul Roy,Operations Executive,45000.0,2021-08-09,50,116.0
17,118,Meena Paul,Logistics Officer,42000.0,2022-07-19,50,116.0
18,119,Abhishek Yadav,Clerk,32000.0,2023-03-28,20,103.0
19,120,Lakshmi Menon,Assistant HR,37000.0,2024-02-12,10,102.0

In [32]:
#sorting data
#sorting salary in ascending order
data1=empdata.sort_values('salary',ascending=True)
data1

,emp_id,emp_name,job_title,salary,hire_date,dept_id,manager_id
14,115,Dev Patel,Sales Intern,25000.0,2024-04-12,40,105.0
18,119,Abhishek Yadav,Clerk,32000.0,2023-03-28,20,103.0
19,120,Lakshmi Menon,Assistant HR,37000.0,2024-02-12,10,102.0
6,107,Vikas Reddy,Recruiter,38000.0,2021-01-09,10,102.0
17,118,Meena Paul,Logistics Officer,42000.0,2022-07-19,50,116.0
5,106,Deepa Nair,HR Executive,42000.0,2020-03-14,10,102.0
13,114,Sneha Joshi,Sales Representative,43000.0,2023-01-05,40,105.0
16,117,Rahul Roy,Operations Executive,45000.0,2021-08-09,50,116.0
7,108,Amit Verma,Accountant,45000.0,2020-09-22,20,103.0
12,113,Ramesh Rao,Sales Executive,47000.0,2022-05-15,40,105.0
8,109,Sonal Gupta,Financial Analyst,52000.0,2021-06-13,20,103.0
11,112,Pooja Iyer,Data Analyst,58000.0,2021-10-27,30,104.0
9,110,Neha Mehta,IT Developer,61000.0,2020-08-18,30,104.0
10,111,Arjun Das,Software Engineer,64000.0,2022-02-20,30,104.0
15,116,Tina George,Operations Lead,67000.0,2020-12-01,50,101.0
2,103,Ravi Kumar,Finance Manager,72000.0,2019-02-11,20,101.0
1,102,Priya Sharma,HR Manager,75000.0,2018-06-21,10,101.0
4,105,Karan Patel,Sales Manager,78000.0,2019-07-17,40,101.0
3,104,Anita Singh,IT Manager,85000.0,2018-11-05,30,101.0
0,101,John Mathews,General Manager,90000.0,2017-03-10,50,NaN

In [27]:
#sorting salary in descending order
empdata.sort_values('salary',ascending=False)

,emp_id,emp_name,job_title,salary,hire_date,dept_id,manager_id
0,101,John Mathews,General Manager,90000.0,2017-03-10,50,NaN
3,104,Anita Singh,IT Manager,85000.0,2018-11-05,30,101.0
4,105,Karan Patel,Sales Manager,78000.0,2019-07-17,40,101.0
1,102,Priya Sharma,HR Manager,75000.0,2018-06-21,10,101.0
2,103,Ravi Kumar,Finance Manager,72000.0,2019-02-11,20,101.0
15,116,Tina George,Operations Lead,67000.0,2020-12-01,50,101.0
10,111,Arjun Das,Software Engineer,64000.0,2022-02-20,30,104.0
9,110,Neha Mehta,IT Developer,61000.0,2020-08-18,30,104.0
11,112,Pooja Iyer,Data Analyst,58000.0,2021-10-27,30,104.0
8,109,Sonal Gupta,Financial Analyst,52000.0,2021-06-13,20,103.0
12,113,Ramesh Rao,Sales Executive,47000.0,2022-05-15,40,105.0
7,108,Amit Verma,Accountant,45000.0,2020-09-22,20,103.0
16,117,Rahul Roy,Operations Executive,45000.0,2021-08-09,50,116.0
13,114,Sneha Joshi,Sales Representative,43000.0,2023-01-05,40,105.0
5,106,Deepa Nair,HR Executive,42000.0,2020-03-14,10,102.0
17,118,Meena Paul,Logistics Officer,42000.0,2022-07-19,50,116.0
6,107,Vikas Reddy,Recruiter,38000.0,2021-01-09,10,102.0
19,120,Lakshmi Menon,Assistant HR,37000.0,2024-02-12,10,102.0
18,119,Abhishek Yadav,Clerk,32000.0,2023-03-28,20,103.0
14,115,Dev Patel,Sales Intern,25000.0,2024-04-12,40,105.0

In [34]:
#Adding column
data1['gross_salary']=data1['salary'].transform(lambda n:n+(n*0.45)+(n*0.35)+(n*0.25))
data1

,emp_id,emp_name,job_title,salary,hire_date,dept_id,manager_id,gross_salary
14,115,Dev Patel,Sales Intern,25000.0,2024-04-12,40,105.0,51250.0
18,119,Abhishek Yadav,Clerk,32000.0,2023-03-28,20,103.0,65600.0
19,120,Lakshmi Menon,Assistant HR,37000.0,2024-02-12,10,102.0,75850.0
6,107,Vikas Reddy,Recruiter,38000.0,2021-01-09,10,102.0,77900.0
17,118,Meena Paul,Logistics Officer,42000.0,2022-07-19,50,116.0,86100.0
5,106,Deepa Nair,HR Executive,42000.0,2020-03-14,10,102.0,86100.0
13,114,Sneha Joshi,Sales Representative,43000.0,2023-01-05,40,105.0,88150.0
16,117,Rahul Roy,Operations Executive,45000.0,2021-08-09,50,116.0,92250.0
7,108,Amit Verma,Accountant,45000.0,2020-09-22,20,103.0,92250.0
12,113,Ramesh Rao,Sales Executive,47000.0,2022-05-15,40,105.0,96350.0
8,109,Sonal Gupta,Financial Analyst,52000.0,2021-06-13,20,103.0,106600.0
11,112,Pooja Iyer,Data Analyst,58000.0,2021-10-27,30,104.0,118900.0
9,110,Neha Mehta,IT Developer,61000.0,2020-08-18,30,104.0,125050.0
10,111,Arjun Das,Software Engineer,64000.0,2022-02-20,30,104.0,131200.0
15,116,Tina George,Operations Lead,67000.0,2020-12-01,50,101.0,137350.0
2,103,Ravi Kumar,Finance Manager,72000.0,2019-02-11,20,101.0,147600.0
1,102,Priya Sharma,HR Manager,75000.0,2018-06-21,10,101.0,153750.0
4,105,Karan Patel,Sales Manager,78000.0,2019-07-17,40,101.0,159900.0
3,104,Anita Singh,IT Manager,85000.0,2018-11-05,30,101.0,174250.0
0,101,John Mathews,General Manager,90000.0,2017-03-10,50,NaN,184500.0

In [35]:
empdata

,emp_id,emp_name,job_title,salary,hire_date,dept_id,manager_id
0,101,John Mathews,General Manager,90000.0,2017-03-10,50,NaN
1,102,Priya Sharma,HR Manager,75000.0,2018-06-21,10,101.0
2,103,Ravi Kumar,Finance Manager,72000.0,2019-02-11,20,101.0
3,104,Anita Singh,IT Manager,85000.0,2018-11-05,30,101.0
4,105,Karan Patel,Sales Manager,78000.0,2019-07-17,40,101.0
5,106,Deepa Nair,HR Executive,42000.0,2020-03-14,10,102.0
6,107,Vikas Reddy,Recruiter,38000.0,2021-01-09,10,102.0
7,108,Amit Verma,Accountant,45000.0,2020-09-22,20,103.0
8,109,Sonal Gupta,Financial Analyst,52000.0,2021-06-13,20,103.0
9,110,Neha Mehta,IT Developer,61000.0,2020-08-18,30,104.0
10,111,Arjun Das,Software Engineer,64000.0,2022-02-20,30,104.0
11,112,Pooja Iyer,Data Analyst,58000.0,2021-10-27,30,104.0
12,113,Ramesh Rao,Sales Executive,47000.0,2022-05-15,40,105.0
13,114,Sneha Joshi,Sales Representative,43000.0,2023-01-05,40,105.0
14,115,Dev Patel,Sales Intern,25000.0,2024-04-12,40,105.0
15,116,Tina George,Operations Lead,67000.0,2020-12-01,50,101.0
16,117,Rahul Roy,Operations Executive,45000.0,2021-08-09,50,116.0
17,118,Meena Paul,Logistics Officer,42000.0,2022-07-19,50,116.0
18,119,Abhishek Yadav,Clerk,32000.0,2023-03-28,20,103.0
19,120,Lakshmi Menon,Assistant HR,37000.0,2024-02-12,10,102.0

In [17]:
myData=empdata.sort_values('salary',ascending=True)
myData

,emp_id,emp_name,job_title,salary,hire_date,dept_id,manager_id
14,115,Dev Patel,Sales Intern,25000.0,2024-04-12,40,105.0
18,119,Abhishek Yadav,Clerk,32000.0,2023-03-28,20,103.0
19,120,Lakshmi Menon,Assistant HR,37000.0,2024-02-12,10,102.0
6,107,Vikas Reddy,Recruiter,38000.0,2021-01-09,10,102.0
17,118,Meena Paul,Logistics Officer,42000.0,2022-07-19,50,116.0
5,106,Deepa Nair,HR Executive,42000.0,2020-03-14,10,102.0
13,114,Sneha Joshi,Sales Representative,43000.0,2023-01-05,40,105.0
16,117,Rahul Roy,Operations Executive,45000.0,2021-08-09,50,116.0
7,108,Amit Verma,Accountant,45000.0,2020-09-22,20,103.0
12,113,Ramesh Rao,Sales Executive,47000.0,2022-05-15,40,105.0
8,109,Sonal Gupta,Financial Analyst,52000.0,2021-06-13,20,103.0
11,112,Pooja Iyer,Data Analyst,58000.0,2021-10-27,30,104.0
9,110,Neha Mehta,IT Developer,61000.0,2020-08-18,30,104.0
10,111,Arjun Das,Software Engineer,64000.0,2022-02-20,30,104.0
15,116,Tina George,Operations Lead,67000.0,2020-12-01,50,101.0
2,103,Ravi Kumar,Finance Manager,72000.0,2019-02-11,20,101.0
1,102,Priya Sharma,HR Manager,75000.0,2018-06-21,10,101.0
4,105,Karan Patel,Sales Manager,78000.0,2019-07-17,40,101.0
3,104,Anita Singh,IT Manager,85000.0,2018-11-05,30,101.0
0,101,John Mathews,General Manager,90000.0,2017-03-10,50,NaN

In [40]:
avgdata=empdata.groupby('dept_id')['salary'].mean()
avgdata

dept_id
10    48000.0
20    50250.0
30    67000.0
40    48250.0
50    61000.0
Name: salary, dtype: float64

In [37]:
#salary greater than 50000 in ascending order and groupby dept_id
#apply and assign a new column called gross_sal by increasing 100 in salary
result= (myData[myData['salary']>50000]
         .sort_values('salary',ascending=True)
         .groupby('dept_id')
         .apply(lambda n: n.assign(gross_sal=n['salary']+100)))
result

C:\Users\lokes\AppData\Local\Temp\ipykernel_10280\1900899595.py:6: FutureWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  .apply(lambda n: n.assign(gross_sal=n['salary']+100)))

            emp_id      emp_name          job_title   salary   hire_date  \
dept_id
10      1      102  Priya Sharma         HR Manager  75000.0  2018-06-21
20      8      109   Sonal Gupta  Financial Analyst  52000.0  2021-06-13
        2      103    Ravi Kumar    Finance Manager  72000.0  2019-02-11
30      11     112    Pooja Iyer       Data Analyst  58000.0  2021-10-27
        9      110    Neha Mehta       IT Developer  61000.0  2020-08-18
        10     111     Arjun Das  Software Engineer  64000.0  2022-02-20
        3      104   Anita Singh         IT Manager  85000.0  2018-11-05
40      4      105   Karan Patel      Sales Manager  78000.0  2019-07-17
50      15     116   Tina George    Operations Lead  67000.0  2020-12-01
        0      101  John Mathews    General Manager  90000.0  2017-03-10

            dept_id  manager_id  gross_sal
dept_id
10      1        10       101.0    75100.0
20      8        20       103.0    52100.0
        2        20       101.0    72100.0
30      11       30       104.0    58100.0
        9        30       104.0    61100.0
        10       30       104.0    64100.0
        3        30       101.0    85100.0
40      4        40       101.0    78100.0
50      15       50       101.0    67100.0
        0        50         NaN    90100.0

In [41]:
empdata

,emp_id,emp_name,job_title,salary,hire_date,dept_id,manager_id
0,101,John Mathews,General Manager,90000.0,2017-03-10,50,NaN
1,102,Priya Sharma,HR Manager,75000.0,2018-06-21,10,101.0
2,103,Ravi Kumar,Finance Manager,72000.0,2019-02-11,20,101.0
3,104,Anita Singh,IT Manager,85000.0,2018-11-05,30,101.0
4,105,Karan Patel,Sales Manager,78000.0,2019-07-17,40,101.0
5,106,Deepa Nair,HR Executive,42000.0,2020-03-14,10,102.0
6,107,Vikas Reddy,Recruiter,38000.0,2021-01-09,10,102.0
7,108,Amit Verma,Accountant,45000.0,2020-09-22,20,103.0
8,109,Sonal Gupta,Financial Analyst,52000.0,2021-06-13,20,103.0
9,110,Neha Mehta,IT Developer,61000.0,2020-08-18,30,104.0
10,111,Arjun Das,Software Engineer,64000.0,2022-02-20,30,104.0
11,112,Pooja Iyer,Data Analyst,58000.0,2021-10-27,30,104.0
12,113,Ramesh Rao,Sales Executive,47000.0,2022-05-15,40,105.0
13,114,Sneha Joshi,Sales Representative,43000.0,2023-01-05,40,105.0
14,115,Dev Patel,Sales Intern,25000.0,2024-04-12,40,105.0
15,116,Tina George,Operations Lead,67000.0,2020-12-01,50,101.0
16,117,Rahul Roy,Operations Executive,45000.0,2021-08-09,50,116.0
17,118,Meena Paul,Logistics Officer,42000.0,2022-07-19,50,116.0
18,119,Abhishek Yadav,Clerk,32000.0,2023-03-28,20,103.0
19,120,Lakshmi Menon,Assistant HR,37000.0,2024-02-12,10,102.0

In [49]:
#pivot tables
pivottable1=empdata.pivot_table(index='dept_id',columns='job_title',values='salary',aggfunc='count',margins=True,margins_name='Grand_total')
pivottable1

job_title,Accountant,Assistant HR,Clerk,Data Analyst,Finance Manager,Financial Analyst,General Manager,HR Executive,HR Manager,IT Developer,...,Logistics Officer,Operations Executive,Operations Lead,Recruiter,Sales Executive,Sales Intern,Sales Manager,Sales Representative,Software Engineer,Grand_total
dept_id,,,,,,,,,,,,,,,,,,,,,
10,NaN,1.0,NaN,NaN,NaN,NaN,NaN,1.0,1.0,NaN,...,NaN,NaN,NaN,1.0,NaN,NaN,NaN,NaN,NaN,4
20,1.0,NaN,1.0,NaN,1.0,1.0,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,4
30,NaN,NaN,NaN,1.0,NaN,NaN,NaN,NaN,NaN,1.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1.0,4
40,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,1.0,1.0,1.0,1.0,NaN,4
50,NaN,NaN,NaN,NaN,NaN,NaN,1.0,NaN,NaN,NaN,...,1.0,1.0,1.0,NaN,NaN,NaN,NaN,NaN,NaN,4
Grand_total,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,...,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,20

In [50]:
pivottable2=empdata.pivot_table(index='dept_id',columns='job_title',values='salary',aggfunc='mean',margins=True,margins_name='Grand_total')
pivottable2

job_title,Accountant,Assistant HR,Clerk,Data Analyst,Finance Manager,Financial Analyst,General Manager,HR Executive,HR Manager,IT Developer,...,Logistics Officer,Operations Executive,Operations Lead,Recruiter,Sales Executive,Sales Intern,Sales Manager,Sales Representative,Software Engineer,Grand_total
dept_id,,,,,,,,,,,,,,,,,,,,,
10,NaN,37000.0,NaN,NaN,NaN,NaN,NaN,42000.0,75000.0,NaN,...,NaN,NaN,NaN,38000.0,NaN,NaN,NaN,NaN,NaN,48000.0
20,45000.0,NaN,32000.0,NaN,72000.0,52000.0,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,50250.0
30,NaN,NaN,NaN,58000.0,NaN,NaN,NaN,NaN,NaN,61000.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,64000.0,67000.0
40,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,47000.0,25000.0,78000.0,43000.0,NaN,48250.0
50,NaN,NaN,NaN,NaN,NaN,NaN,90000.0,NaN,NaN,NaN,...,42000.0,45000.0,67000.0,NaN,NaN,NaN,NaN,NaN,NaN,61000.0
Grand_total,45000.0,37000.0,32000.0,58000.0,72000.0,52000.0,90000.0,42000.0,75000.0,61000.0,...,42000.0,45000.0,67000.0,38000.0,47000.0,25000.0,78000.0,43000.0,64000.0,54900.0

In [59]:
#pivot tables
pivottable3=empdata.pivot_table(index='dept_id',columns='job_title',values='salary',aggfunc=['max','min','std','var'],margins=True,margins_name='Grand_total')
pivottable3

                   max                                                     \
job_title   Accountant Assistant HR    Clerk Data Analyst Finance Manager
dept_id
10                 NaN      37000.0      NaN          NaN             NaN
20             45000.0          NaN  32000.0          NaN         72000.0
30                 NaN          NaN      NaN      58000.0             NaN
40                 NaN          NaN      NaN          NaN             NaN
50                 NaN          NaN      NaN          NaN             NaN
Grand_total    45000.0      37000.0  32000.0      58000.0         72000.0

                                                                       \
job_title   Financial Analyst General Manager HR Executive HR Manager
dept_id
10                        NaN             NaN      42000.0    75000.0
20                    52000.0             NaN          NaN        NaN
30                        NaN             NaN          NaN        NaN
40                        NaN             NaN          NaN        NaN
50                        NaN         90000.0          NaN        NaN
Grand_total           52000.0         90000.0      42000.0    75000.0

                          ...               min                       \
job_title   IT Developer  ... Logistics Officer Operations Executive
dept_id                   ...
10                   NaN  ...               NaN                  NaN
20                   NaN  ...               NaN                  NaN
30               61000.0  ...               NaN                  NaN
40                   NaN  ...               NaN                  NaN
50                   NaN  ...           42000.0              45000.0
Grand_total      61000.0  ...           42000.0              45000.0

                                                                    \
job_title   Operations Lead Recruiter Sales Executive Sales Intern
dept_id
10                      NaN   38000.0             NaN          NaN
20                      NaN       NaN             NaN          NaN
30                      NaN       NaN             NaN          NaN
40                      NaN       NaN         47000.0      25000.0
50                  67000.0       NaN             NaN          NaN
Grand_total         67000.0   38000.0         47000.0      25000.0


job_title   Sales Manager Sales Representative Software Engineer Grand_total
dept_id
10                    NaN                  NaN               NaN     37000.0
20                    NaN                  NaN               NaN     32000.0
30                    NaN                  NaN           64000.0     58000.0
40                78000.0              43000.0               NaN     25000.0
50                    NaN                  NaN               NaN     42000.0
Grand_total       78000.0              43000.0           64000.0     25000.0

[6 rows x 42 columns]

In [61]:
pivottable3=empdata.pivot_table(index='dept_id',values='salary',aggfunc=['count','mean','sum','max','min','std','var'])
pivottable3

,count,mean,sum,max,min,std,var
,salary,salary,salary,salary,salary,salary,salary
dept_id,,,,,,,
10,4,48000.0,192000.0,75000.0,37000.0,18129.166188,3.286667e+08
20,4,50250.0,201000.0,72000.0,32000.0,16700.798384,2.789167e+08
30,4,67000.0,268000.0,85000.0,58000.0,12247.448714,1.500000e+08
40,4,48250.0,193000.0,78000.0,25000.0,22020.823478,4.849167e+08
50,4,61000.0,244000.0,90000.0,42000.0,22315.913604,4.980000e+08

In [64]:
#Date is here object
empdata['hire_date'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 20 entries, 0 to 19
Series name: hire_date
Non-Null Count  Dtype
--------------  -----
20 non-null     object
dtypes: object(1)
memory usage: 292.0+ bytes

In [67]:
#Converting object date into datetime
empdata['hire_date']=pd.to_datetime(empdata['hire_date']).info()

<class 'pandas.core.series.Series'>
RangeIndex: 20 entries, 0 to 19
Series name: hire_date
Non-Null Count  Dtype
--------------  -----
20 non-null     datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 292.0 bytes

In [68]:
empdata

,emp_id,emp_name,job_title,salary,hire_date,dept_id,manager_id
0,101,John Mathews,General Manager,90000.0,None,50,NaN
1,102,Priya Sharma,HR Manager,75000.0,None,10,101.0
2,103,Ravi Kumar,Finance Manager,72000.0,None,20,101.0
3,104,Anita Singh,IT Manager,85000.0,None,30,101.0
4,105,Karan Patel,Sales Manager,78000.0,None,40,101.0
5,106,Deepa Nair,HR Executive,42000.0,None,10,102.0
6,107,Vikas Reddy,Recruiter,38000.0,None,10,102.0
7,108,Amit Verma,Accountant,45000.0,None,20,103.0
8,109,Sonal Gupta,Financial Analyst,52000.0,None,20,103.0
9,110,Neha Mehta,IT Developer,61000.0,None,30,104.0
10,111,Arjun Das,Software Engineer,64000.0,None,30,104.0
11,112,Pooja Iyer,Data Analyst,58000.0,None,30,104.0
12,113,Ramesh Rao,Sales Executive,47000.0,None,40,105.0
13,114,Sneha Joshi,Sales Representative,43000.0,None,40,105.0
14,115,Dev Patel,Sales Intern,25000.0,None,40,105.0
15,116,Tina George,Operations Lead,67000.0,None,50,101.0
16,117,Rahul Roy,Operations Executive,45000.0,None,50,116.0
17,118,Meena Paul,Logistics Officer,42000.0,None,50,116.0
18,119,Abhishek Yadav,Clerk,32000.0,None,20,103.0
19,120,Lakshmi Menon,Assistant HR,37000.0,None,10,102.0

In [71]:
empdata.rename(columns={'emp_id':'EMPID','emp_name':'EMPNAME','job_title':'JOB','salary':'SALARY','hire_date':'HIRED','dept_id':'DEPTID','manager_id':'MID'})

    EMPID         EMPNAME                   JOB   SALARY HIRED  DEPTID    MID
0     101    John Mathews       General Manager  90000.0  None      50    NaN
1     102    Priya Sharma            HR Manager  75000.0  None      10  101.0
2     103      Ravi Kumar       Finance Manager  72000.0  None      20  101.0
3     104     Anita Singh            IT Manager  85000.0  None      30  101.0
4     105     Karan Patel         Sales Manager  78000.0  None      40  101.0
5     106      Deepa Nair          HR Executive  42000.0  None      10  102.0
6     107     Vikas Reddy             Recruiter  38000.0  None      10  102.0
7     108      Amit Verma            Accountant  45000.0  None      20  103.0
8     109     Sonal Gupta     Financial Analyst  52000.0  None      20  103.0
9     110      Neha Mehta          IT Developer  61000.0  None      30  104.0
10    111       Arjun Das     Software Engineer  64000.0  None      30  104.0
11    112      Pooja Iyer          Data Analyst  58000.0  None      30  104.0
12    113      Ramesh Rao       Sales Executive  47000.0  None      40  105.0
13    114     Sneha Joshi  Sales Representative  43000.0  None      40  105.0
14    115       Dev Patel          Sales Intern  25000.0  None      40  105.0
15    116     Tina George       Operations Lead  67000.0  None      50  101.0
16    117       Rahul Roy  Operations Executive  45000.0  None      50  116.0
17    118      Meena Paul     Logistics Officer  42000.0  None      50  116.0
18    119  Abhishek Yadav                 Clerk  32000.0  None      20  103.0
19    120   Lakshmi Menon          Assistant HR  37000.0  None      10  102.0

In [72]:
empdata
#here column names didnot changed permanently

,emp_id,emp_name,job_title,salary,hire_date,dept_id,manager_id
0,101,John Mathews,General Manager,90000.0,None,50,NaN
1,102,Priya Sharma,HR Manager,75000.0,None,10,101.0
2,103,Ravi Kumar,Finance Manager,72000.0,None,20,101.0
3,104,Anita Singh,IT Manager,85000.0,None,30,101.0
4,105,Karan Patel,Sales Manager,78000.0,None,40,101.0
5,106,Deepa Nair,HR Executive,42000.0,None,10,102.0
6,107,Vikas Reddy,Recruiter,38000.0,None,10,102.0
7,108,Amit Verma,Accountant,45000.0,None,20,103.0
8,109,Sonal Gupta,Financial Analyst,52000.0,None,20,103.0
9,110,Neha Mehta,IT Developer,61000.0,None,30,104.0
10,111,Arjun Das,Software Engineer,64000.0,None,30,104.0
11,112,Pooja Iyer,Data Analyst,58000.0,None,30,104.0
12,113,Ramesh Rao,Sales Executive,47000.0,None,40,105.0
13,114,Sneha Joshi,Sales Representative,43000.0,None,40,105.0
14,115,Dev Patel,Sales Intern,25000.0,None,40,105.0
15,116,Tina George,Operations Lead,67000.0,None,50,101.0
16,117,Rahul Roy,Operations Executive,45000.0,None,50,116.0
17,118,Meena Paul,Logistics Officer,42000.0,None,50,116.0
18,119,Abhishek Yadav,Clerk,32000.0,None,20,103.0
19,120,Lakshmi Menon,Assistant HR,37000.0,None,10,102.0

In [74]:
empdata.rename(columns={'emp_id':'EMPID','emp_name':'EMPNAME','job_title':'JOB','salary':'SALARY','hire_date':'HIRED','dept_id':'DEPTID','manager_id':'MID'},inplace=True)
empdata #permanently changed

    EMPID         EMPNAME                   JOB   SALARY HIRED  DEPTID    MID
0     101    John Mathews       General Manager  90000.0  None      50    NaN
1     102    Priya Sharma            HR Manager  75000.0  None      10  101.0
2     103      Ravi Kumar       Finance Manager  72000.0  None      20  101.0
3     104     Anita Singh            IT Manager  85000.0  None      30  101.0
4     105     Karan Patel         Sales Manager  78000.0  None      40  101.0
5     106      Deepa Nair          HR Executive  42000.0  None      10  102.0
6     107     Vikas Reddy             Recruiter  38000.0  None      10  102.0
7     108      Amit Verma            Accountant  45000.0  None      20  103.0
8     109     Sonal Gupta     Financial Analyst  52000.0  None      20  103.0
9     110      Neha Mehta          IT Developer  61000.0  None      30  104.0
10    111       Arjun Das     Software Engineer  64000.0  None      30  104.0
11    112      Pooja Iyer          Data Analyst  58000.0  None      30  104.0
12    113      Ramesh Rao       Sales Executive  47000.0  None      40  105.0
13    114     Sneha Joshi  Sales Representative  43000.0  None      40  105.0
14    115       Dev Patel          Sales Intern  25000.0  None      40  105.0
15    116     Tina George       Operations Lead  67000.0  None      50  101.0
16    117       Rahul Roy  Operations Executive  45000.0  None      50  116.0
17    118      Meena Paul     Logistics Officer  42000.0  None      50  116.0
18    119  Abhishek Yadav                 Clerk  32000.0  None      20  103.0
19    120   Lakshmi Menon          Assistant HR  37000.0  None      10  102.0

In [79]:
empdata['SALARY'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 20 entries, 0 to 19
Series name: SALARY
Non-Null Count  Dtype
--------------  -----
20 non-null     float64
dtypes: float64(1)
memory usage: 292.0 bytes

In [75]:
empdata['SALARY']=empdata['SALARY'].astype(float)
empdata

    EMPID         EMPNAME                   JOB   SALARY HIRED  DEPTID    MID
0     101    John Mathews       General Manager  90000.0  None      50    NaN
1     102    Priya Sharma            HR Manager  75000.0  None      10  101.0
2     103      Ravi Kumar       Finance Manager  72000.0  None      20  101.0
3     104     Anita Singh            IT Manager  85000.0  None      30  101.0
4     105     Karan Patel         Sales Manager  78000.0  None      40  101.0
5     106      Deepa Nair          HR Executive  42000.0  None      10  102.0
6     107     Vikas Reddy             Recruiter  38000.0  None      10  102.0
7     108      Amit Verma            Accountant  45000.0  None      20  103.0
8     109     Sonal Gupta     Financial Analyst  52000.0  None      20  103.0
9     110      Neha Mehta          IT Developer  61000.0  None      30  104.0
10    111       Arjun Das     Software Engineer  64000.0  None      30  104.0
11    112      Pooja Iyer          Data Analyst  58000.0  None      30  104.0
12    113      Ramesh Rao       Sales Executive  47000.0  None      40  105.0
13    114     Sneha Joshi  Sales Representative  43000.0  None      40  105.0
14    115       Dev Patel          Sales Intern  25000.0  None      40  105.0
15    116     Tina George       Operations Lead  67000.0  None      50  101.0
16    117       Rahul Roy  Operations Executive  45000.0  None      50  116.0
17    118      Meena Paul     Logistics Officer  42000.0  None      50  116.0
18    119  Abhishek Yadav                 Clerk  32000.0  None      20  103.0
19    120   Lakshmi Menon          Assistant HR  37000.0  None      10  102.0

In [81]:
empdata['GROSS_SAL']=empdata['SALARY']+(empdata['SALARY']*0.4)+(empdata['SALARY']*0.3)+(empdata['SALARY']*0.5)
empdata

,EMPID,EMPNAME,JOB,SALARY,HIRED,DEPTID,MID,GROSS_SAL
0,101,John Mathews,General Manager,90000.0,None,50,NaN,198000.0
1,102,Priya Sharma,HR Manager,75000.0,None,10,101.0,165000.0
2,103,Ravi Kumar,Finance Manager,72000.0,None,20,101.0,158400.0
3,104,Anita Singh,IT Manager,85000.0,None,30,101.0,187000.0
4,105,Karan Patel,Sales Manager,78000.0,None,40,101.0,171600.0
5,106,Deepa Nair,HR Executive,42000.0,None,10,102.0,92400.0
6,107,Vikas Reddy,Recruiter,38000.0,None,10,102.0,83600.0
7,108,Amit Verma,Accountant,45000.0,None,20,103.0,99000.0
8,109,Sonal Gupta,Financial Analyst,52000.0,None,20,103.0,114400.0
9,110,Neha Mehta,IT Developer,61000.0,None,30,104.0,134200.0
10,111,Arjun Das,Software Engineer,64000.0,None,30,104.0,140800.0
11,112,Pooja Iyer,Data Analyst,58000.0,None,30,104.0,127600.0
12,113,Ramesh Rao,Sales Executive,47000.0,None,40,105.0,103400.0
13,114,Sneha Joshi,Sales Representative,43000.0,None,40,105.0,94600.0
14,115,Dev Patel,Sales Intern,25000.0,None,40,105.0,55000.0
15,116,Tina George,Operations Lead,67000.0,None,50,101.0,147400.0
16,117,Rahul Roy,Operations Executive,45000.0,None,50,116.0,99000.0
17,118,Meena Paul,Logistics Officer,42000.0,None,50,116.0,92400.0
18,119,Abhishek Yadav,Clerk,32000.0,None,20,103.0,70400.0
19,120,Lakshmi Menon,Assistant HR,37000.0,None,10,102.0,81400.0

In [82]:
#Adding annual salary
empdata['ANNUAL SALARY']=empdata['GROSS_SAL']+12
empdata

,EMPID,EMPNAME,JOB,SALARY,HIRED,DEPTID,MID,GROSS_SAL,ANNUAL SALARY
0,101,John Mathews,General Manager,90000.0,None,50,NaN,198000.0,198012.0
1,102,Priya Sharma,HR Manager,75000.0,None,10,101.0,165000.0,165012.0
2,103,Ravi Kumar,Finance Manager,72000.0,None,20,101.0,158400.0,158412.0
3,104,Anita Singh,IT Manager,85000.0,None,30,101.0,187000.0,187012.0
4,105,Karan Patel,Sales Manager,78000.0,None,40,101.0,171600.0,171612.0
5,106,Deepa Nair,HR Executive,42000.0,None,10,102.0,92400.0,92412.0
6,107,Vikas Reddy,Recruiter,38000.0,None,10,102.0,83600.0,83612.0
7,108,Amit Verma,Accountant,45000.0,None,20,103.0,99000.0,99012.0
8,109,Sonal Gupta,Financial Analyst,52000.0,None,20,103.0,114400.0,114412.0
9,110,Neha Mehta,IT Developer,61000.0,None,30,104.0,134200.0,134212.0
10,111,Arjun Das,Software Engineer,64000.0,None,30,104.0,140800.0,140812.0
11,112,Pooja Iyer,Data Analyst,58000.0,None,30,104.0,127600.0,127612.0
12,113,Ramesh Rao,Sales Executive,47000.0,None,40,105.0,103400.0,103412.0
13,114,Sneha Joshi,Sales Representative,43000.0,None,40,105.0,94600.0,94612.0
14,115,Dev Patel,Sales Intern,25000.0,None,40,105.0,55000.0,55012.0
15,116,Tina George,Operations Lead,67000.0,None,50,101.0,147400.0,147412.0
16,117,Rahul Roy,Operations Executive,45000.0,None,50,116.0,99000.0,99012.0
17,118,Meena Paul,Logistics Officer,42000.0,None,50,116.0,92400.0,92412.0
18,119,Abhishek Yadav,Clerk,32000.0,None,20,103.0,70400.0,70412.0
19,120,Lakshmi Menon,Assistant HR,37000.0,None,10,102.0,81400.0,81412.0

In [86]:
#Adding varibale pay on annual salary
empdata['VARIABLE PAY']=empdata['ANNUAL SALARY']*0.3
empdata

,EMPID,EMPNAME,JOB,SALARY,HIRED,DEPTID,MID,GROSS_SAL,ANNUAL SALARY,VARIABLE PAY
0,101,John Mathews,General Manager,90000.0,None,50,NaN,198000.0,198012.0,59403.6
1,102,Priya Sharma,HR Manager,75000.0,None,10,101.0,165000.0,165012.0,49503.6
2,103,Ravi Kumar,Finance Manager,72000.0,None,20,101.0,158400.0,158412.0,47523.6
3,104,Anita Singh,IT Manager,85000.0,None,30,101.0,187000.0,187012.0,56103.6
4,105,Karan Patel,Sales Manager,78000.0,None,40,101.0,171600.0,171612.0,51483.6
5,106,Deepa Nair,HR Executive,42000.0,None,10,102.0,92400.0,92412.0,27723.6
6,107,Vikas Reddy,Recruiter,38000.0,None,10,102.0,83600.0,83612.0,25083.6
7,108,Amit Verma,Accountant,45000.0,None,20,103.0,99000.0,99012.0,29703.6
8,109,Sonal Gupta,Financial Analyst,52000.0,None,20,103.0,114400.0,114412.0,34323.6
9,110,Neha Mehta,IT Developer,61000.0,None,30,104.0,134200.0,134212.0,40263.6
10,111,Arjun Das,Software Engineer,64000.0,None,30,104.0,140800.0,140812.0,42243.6
11,112,Pooja Iyer,Data Analyst,58000.0,None,30,104.0,127600.0,127612.0,38283.6
12,113,Ramesh Rao,Sales Executive,47000.0,None,40,105.0,103400.0,103412.0,31023.6
13,114,Sneha Joshi,Sales Representative,43000.0,None,40,105.0,94600.0,94612.0,28383.6
14,115,Dev Patel,Sales Intern,25000.0,None,40,105.0,55000.0,55012.0,16503.6
15,116,Tina George,Operations Lead,67000.0,None,50,101.0,147400.0,147412.0,44223.6
16,117,Rahul Roy,Operations Executive,45000.0,None,50,116.0,99000.0,99012.0,29703.6
17,118,Meena Paul,Logistics Officer,42000.0,None,50,116.0,92400.0,92412.0,27723.6
18,119,Abhishek Yadav,Clerk,32000.0,None,20,103.0,70400.0,70412.0,21123.6
19,120,Lakshmi Menon,Assistant HR,37000.0,None,10,102.0,81400.0,81412.0,24423.6

In [92]:
#deleting column
empdata=empdata.drop(columns=['VARIABLE PAY'])
empdata

KeyError: "['VARIABLE PAY'] not found in axis"